# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 100  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]


# #0.623
backbone:
  -  [-1, 1, MS_GetT, [3,1]]  #仅用于增加T               #0 [1,3,640,640]->[1,1,3,640,640]

  #-  [-1, 1, MS_StandardConv, [128, 3, 1]]
  -  [-1, 1, MS_DownSampling, [128, 3, 1, 1, True]]     #1 [1,1,3,640,640]->[1,1,64,160,160]
  -  [-1, 3, MS_AllConvBlock, [4,7]]                        #2 [1,1,64,160,160]->[1,1,64,160,160]

  -  [-1, 1, MS_AIFI, [128, 8]]

  -  [-1, 1, MS_DownSampling, [384, 3, 2, 1, True]]
  -  [-1, 6, MS_AIFI, [384, 8]]

  - [ -1, 1, MS_DownSampling, [768, 3, 2, 1, True ] ]
  - [ -1, 9, MS_AIFI, [768, 8 ] ]


head:
  - [-1, 1, Classify, [nc]]



